Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: For Timeout, specifying 0 is no longer the same as specifying 0.5; instead, it produces the shortest wait possible.
ja: Timeoutについては、0を指定しても0.5を指定したのと同じではなく、可能な限り短い待ち時間を生成するようになりました。

source: For X+ and Y+, the letter M can be used as a substitute for the window's current margin.
ja: X+、 Y+の場合、ウィンドウの現在のマージンの代用としてMという文字が使えます。

source: For ClickCount, specify the number of notches to turn the wheel.
ja: ClickCountには、ホイールを回すノッチ数を指定します。

source: For AutoHotkey objects, this is __Item.
ja: AutoHotkeyオブジェクトの場合、これは__Itemです。

source: For COM objects, Value1 contains the value returned by IEnumVARIANT::Next() and Value2 contains a number which represents its variant type.
ja: COM オブジェクトの場合、Value1にはIEnumVARIANT::Next()が返す値が、Value2にはそのバリアントタイプを表す数値が含まれます。

source: For COM objects, this will typically fail (throw an exception or produce the wrong result) unless the COM object is actually an AutoHotkey object from another process.
ja: COMオブジェクトの場合、COMオブジェクトが実際には別のプロセスのAutoHotkeyオブジェクトでない限り、これは通常失敗します（例外をスローするか、間違った結果を生成します）。

source: For COM wrapper objects, the class name can also be determined based on the variant type, as follows:
ja: COMラッパー・オブジェクトの場合、以下のようにバリアント・タイプに基づいてクラス名を決定することもできます：

source: For Ctrl in MyGui
ja: MyGuiのCtrlの場合

source: For DateTime controls, NewValue may be an empty string to cause the control to have no date/time selected (if it was created with that ability).
ja: DateTimeコントロールの場合、NewValueに空文字列を指定すると、（その能力で作成された場合）コントロールに日付/時刻が選択されないようにすることができる。

source: For DllCall, NumPut and NumGet, use the Ptr type where appropriate.
ja: DllCall、NumPut、NumGetについては、適宜Ptr型を使用します。

source: For DropDownList, ComboBox, ListBox and Tab, this causes Gui.Submit to store the position of the selected item rather than its text.
ja: DropDownList、ComboBox、ListBox、Tabの場合、Gui.Submitに選択項目のテキストではなく、その位置が保存されるようになるためです。

source: For Example:
ja: 事例：

source: For GIF files, *TransWhite might be most likely to work.
ja: GIFファイルの場合、*TransWhiteが最も可能性が高いかもしれません。

source: For GroupBoxes and Text controls, pressing the shortcut causes keyboard focus to jump to the first input-capable tabstop control that was created after it.
ja: グループボックスとテキストコントロールの場合、ショートカットを押すと、その後に作成された最初の入力可能なタブストップコントロールにキーボードフォーカスが移動するようにします。

source: For Hwnd, Ctrl in MyGui
ja: MyGuiのHwnd、Ctrlの場合

source: For Hwnd, GuiCtrlObj in MyGui
ja: MyGuiのHwnd、GuiCtrlObjの場合

source: For Loop - Syntax & Usage | AutoHotkey v2
ja: Forループ - 構文と使用法｜AutoHotkey v2

source: For MonthCal controls, a range may be specified if the control is multi-select.
ja: MonthCalコントロールの場合、複数選択可能な場合は、範囲を指定することができます。

source: For PNG and TIF files, *TransBlack might be best.
ja: PNGやTIFファイルの場合、*TransBlackが最適かもしれません。

source: For Radio buttons, if one is being checked (turned on) and it is a member of a multi-radio group, the other radio buttons in its group will be automatically unchecked.
ja: ラジオボタンの場合、あるラジオボタンがチェックされている（オンになっている）場合、そのラジオボタンがマルチラジオグループのメンバーであれば、そのグループ内の他のラジオボタンは自動的にチェックされなくなります。

source: For Send/SendEvent mode, a delay of 0 internally executes a Sleep(0), which yields the remainder of the script's timeslice to any other process that may need it.
ja: Send/SendEventモードでは、遅延が0の場合、内部的にSleep(0)が実行され、スクリプトのタイムスライスの残りを必要とする他のプロセスに提供します。

source: For SendEvent, SendInput and ControlSend, this improves reliability because the characters are much less dependent on correct modifier state.
ja: SendEvent、SendInput、ControlSendについては、文字が正しい修飾子の状態に依存することが少なくなるため、信頼性が向上する。

source: For Tab controls, it returns 0 if no tab is selected (rare but valid).
ja: タブコントロールの場合、タブが選択されていない場合は0を返します（稀ですが有効です）。

source: For Tab controls, this will also enable or disable all of the tab's sub-controls.
ja: タブコントロールの場合、タブのサブコントロールもすべて有効または無効になります。

source: For Tab controls, this will also show or hide all of the tab's sub-controls.
ja: タブコントロールの場合、タブのサブコントロールの表示・非表示もすべて行います。

source: For Win32_Process, see Microsoft Docs.
ja: Win32_Process については、Microsoft Docsをご覧ください。

source: For Windows 10, replace the HideTrayTip function definition with the one defined above.
ja: Windows 10の場合は、HideTrayTip関数の定義を上記で定義したものに置き換えてください。

source: For Xbox controller 2013 and newer (anything newer than the Xbox 360 controller), Joy1 to Joy32 hotkeys will only work if a window owned by the script is active, such as a message box, GUI, or the script's main window.
ja: Xbox コントローラ 2013 以降（Xbox 360 コントローラより新しいもの）の場合、Joy1～Joy32 のホットキーは、メッセージ ボックス、GUI、スクリプトのメイン ウィンドウなど、スクリプトが所有するウィンドウがアクティブな場合にのみ機能します。

source: For Xbox controller 2013 and newer (anything newer than the Xbox 360 controller), this script will only work if a window it owns is active, such as a message box, GUI, or the script's main window.
ja: Xbox コントローラ 2013 以降（Xbox 360 コントローラより新しいもの）の場合、このスクリプトは、メッセージボックス、GUI、スクリプトのメインウィンドウなど、所有するウィンドウがアクティブな場合にのみ動作します。

source: For __set, the value being assigned is passed separately.
ja: For __setの場合、代入される値は別途渡されます。

source: For a multi-select ListBox, CurrentText is an array.
ja: 多選択リストボックスの場合、CurrentTextは配列になります。

source: For a multi-select ListBox, RetrievedText is an array.
ja: 多選択リストボックスの場合、RetrievedTextは配列になります。

source: For a multi-select ListBox, all matching items are selected.
ja: 複数選択リストボックスの場合、一致するすべての項目が選択されます。

source: For a ListView created via AutoHotkey, this example returns 48 (0x30), a combination of LVS_EX_FULLROWSELECT (0x20) and LVS_EX_HEADERDRAGDROP (0x10), provided the extended ListView styles have not been changed beforehand.
ja: AutoHotkeyで作成されたListViewの場合、この例は 48 (0x30) を返します。これは、LVS_EX_FULLROWSELECT (0x20) と LVS_EX_HEADERDRAGDROP (0x10) の組み合わせである 48 (0x30) を返します。ただし、拡張 ListView スタイルが事前に変更されていない場合に限ります。

source: For a multi-select ListBox, the result is an array of numbers (which is empty if no items are selected).
ja: 複数選択可能なリストボックスの場合、結果は数値の配列になります（項目が選択されていない場合は空です）。

source: For a ComboBox, if there is no selected item, the text in the control's edit field is retrieved instead.
ja: コンボボックスの場合、選択された項目がない場合は、コントロールのエディットフィールドのテキストを代わりに取得します。

source: For a GUI window, WS_CLIPSIBLINGS is always enabled and cannot be disabled.
ja: GUIウィンドウでは、WS_CLIPSIBLINGSは常に有効であり、無効にすることはできない。

source: For a GroupBox, this setting is the number of controls for which to reserve space inside the box.
ja: グループボックスの場合、ボックス内のスペースを確保するコントロールの数を設定します。

source: For a basic explanation and general details about variables, see Variables.
ja: 変数の基本的な説明と一般的な詳細については、変数を参照してください。

source: For a built-in function, the parameter is considered to have been omitted.
ja: 組込み関数の場合は、パラメータが省略されたものとみなされます。

source: For a description of what the other operators do, see their related entries in this table.
ja: 他の演算子の動作については、この表の関連項目を参照のこと。

source: For a dynamic property, the return value is a new object with an own property for each accessor function:
ja: 動的プロパティの場合、戻り値は、各アクセッサ関数に対応する独自のプロパティを持つ新しいオブジェクトになります：

source: For a dynamic property, the return value is a new object with an own property for each accessor function: Get, Set, Call.
ja: 動的プロパティの場合、戻り値は、各アクセッサ関数に対応する独自のプロパティを持つ新しいオブジェクトになります：Get、Set、Call。

source: For a full list of supported property names and other details, search for "\p{xx}" at www.pcre.org/pcre.txt.
ja: サポートされているプロパティ名の全リストとその他の詳細については、www.pcre.org/pcre.txtで「\p{xx}」を検索してください。

source: For a full list, see Key names.
ja: 全リストは、「主要な名称」をご覧ください。

source: For a full list, see Microsoft Docs:
ja: 全リストは、Microsoft Docs：

source: For a full list, see Microsoft Docs: Extended List-View Styles.
ja: 全リストは、Microsoft Docs：拡張List-Viewスタイルを参照。

source: For a general explanation of control flow, see Control Flow.
ja: 制御フローの一般的な説明については、制御フローを参照してください。

source: For a general explanation of functions and related terminology, see Functions.
ja: 機能の一般的な説明と関連する用語については、機能を参照してください。

source: For a general explanation of window classes and one way to use them, see ahk_class.
ja: ウィンドウクラスの一般的な説明とその使い方については、ahk_classをご覧ください。

source: For a history of changes prior to the v2.0.0 release, refer to the following (but note some changes were superseded):
ja: v2.0.0リリース以前の変更履歴は、以下を参照してください（ただし、一部の変更は上書きされていることにご注意ください）：

source: For a list of all built-in function and variables, see section 5.
ja: すべての組み込み関数と変数のリストについては、セクション5を参照してください。

source: For a list of possible values, see Code Page Identifiers.
ja: 取り得る値のリストについては、コードページ識別子を参照のこと。

source: For a list of supported formats, see the Picture control.
ja: 対応フォーマットの一覧は、ピクチャーコントロールをご覧ください。

source: For a list, see Xdebug:
ja: 一覧は、Xdebugをご覧ください。

source: For a list, see Xdebug: Documentation.
ja: 一覧は、Xdebug：Documentationをご覧ください。

source: For a long list of examples, see the following forum topic:
ja: 長い例のリストは、次のフォーラムのトピックを参照してください。

source: For a more complex example, see SetTimer.
ja: より複雑な例については、SetTimerを参照のこと。

source: For a more complex example, see the soundcard analysis script.
ja: より複雑な例については、>soundcard analysis scriptをご覧ください。

source: For a more detailed explanation of how strings work, see String Encoding.
ja: 文字列の仕組みについてのより詳しい説明は、「文字列のエンコード」をご覧ください。

source: For a more general explanation of strings, see Strings.
ja: 文字列の一般的な説明については、文字列を参照してください。

source: For a multi-statement expression, the result of the last statement is returned.
ja: 複数ステートメント式の場合は、最後のステートメントの結果が返される。

source: For a possible alternative, see the FAQ.
ja: 代替案についてはFAQを参照。

source: For a right-to-left search, StartingPos specifies the position of the last character of the first potential occurence of Needle.
ja: 右から左への検索では、StartingPosは、Needleの最初の出現候補の最後の文字の位置を指定します。

source: For a simple demonstration via hotkeys, see WinSetTransparent example #4.
ja: ホットキーによる簡単なデモンストレーションは、WinSetTransparentの例4を参照してください。

source: For a simple demonstration via hotkeys, see example #4 on the WinSetTransparent page.
ja: ホットキーによる簡単なデモンストレーションは、WinSetTransparentページの例4を参照してください。

source: For a user-defined function, the parameter's default value is used.
ja: ユーザー定義機能の場合、パラメータのデフォルト値が使用されます。

source: For a value property, the return value is a new object with a property named Value.
ja: Valueプロパティの場合、Valueという名前のプロパティを持つ新しいオブジェクトが返り値となる。

source: For a variable x := 42, we can also say that the variable x has the number 42 as its value, or that the value of x is 42.
ja: 変数x := 42の場合、「変数xは42という数字を値として持っている」「xの値は42である」という言い方もできる。

source: For a video instruction, watch Install and Hello World on YouTube.
ja: 動画による説明は、YouTubeのInstall and Hello Worldをご覧ください。

source: For all RegEx callouts to be called in such cases, it may be necessary to disable these optimizations by specifying (*NO_START_OPT) at the start of the pattern.
ja: このような場合にすべてのRegExコールアウトを呼び出すには、パターンの最初に(*NO_START_OPT)を指定して、これらの最適化を無効にする必要があるかもしれない。

source: For all integer types, or when passing pure integers, signed vs. unsigned does not affect the result due to the use of two's complement to represent signed integers.
ja: すべての整数型、または純粋な整数を渡す場合、符号付き整数を表現するために2の補数を使用するため、符号付きと符号無しは結果に影響しません。

source: For all other controls, Info currently has no meaning.
ja: それ以外のコントロールについては、現在、Infoは意味を持ちません。

source: For all remaining uses of labels, it is not valid to refer to a global label from inside a function.
ja: ラベルの残りのすべての用途において、関数内部からグローバルラベルを参照することは無効です。

source: For alternative methods, see the following forum topic:
ja: 代替方法については、以下のフォーラムトピックをご参照ください：

source: For alternatives, see the section below.
ja: 代替案については、以下のセクションを参照してください。

source: For an array literal such as [var?], the element is included in the array's length but is given no value.
ja: [var?]のような配列リテラルでは、その要素は配列の長さに含まれるが、値は与えられない。

source: For an object literal such as {x:
ja: オブジェクトリテラル（{x:

source: For an object literal such as {x: y?}, the property is not assigned.
ja: オブジェクトリテラル（{x: y?}など）の場合、プロパティは付与されない。

source: For an Array, this leaves the array element without a value and doesn't affect other elements in the array.
ja: 配列の場合、これは配列要素に値を残さず、配列の他の要素には影響を与えない。

source: For an auto-replace hotstring which doesn't use the Text or Raw mode, sending a { alone, or one preceded only by white-space, requires it being enclosed in a pair of brackets, for example :*:brace::{{} and :*:space_brace::
ja: TextモードやRawモードを使用しない自動置換ホットストリングの場合、{だけ、またはホワイトスペースだけで先行するものを送信するには、2つのブラケットで囲む必要があります。例えば:*:brace::{{}と:*:space_brace::

source: For an auto-replace hotstring which doesn't use the Text or Raw mode, sending a { alone, or one preceded only by white-space, requires it being enclosed in a pair of brackets, for example :*:brace::{{} and :*:space_brace:: {{}.
ja: TextモードやRawモードを使用しない自動置換ホットストリングの場合、{だけ、またはホワイトスペースだけで先行するものを送信するには、2つのブラケットで囲む必要があります。例えば:*:brace::{{}と:*:space_brace:: {{}。

source: For an example of this, see this FAQ topic.
ja: この例については、このFAQのトピックを参照してください。

source: For an example, see ExecScript().
ja: 例についてはExecScript()を参照。

source: For an example, see ComObjQuery.
ja: 例として、ComObjQueryを参照してください。

source: For an executable file, the *RunAs verb is equivalent to selecting Run as administrator from the right-click menu of the file.
ja: 実行ファイルの場合、*RunAs動詞は、そのファイルの右クリックメニューから「管理者として実行」を選択することと同じです。

source: For an executable work, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the executable.
ja: 実行可能な作品の場合、完全なソースコードとは、その作品に含まれるすべてのモジュールのすべてのソースコードと、関連するインターフェース定義ファイル、さらに実行可能な作品のコンパイルとインストールを制御するために使用されるスクリプトを意味します。

source: For an explanation of how SendLevel and #InputLevel are used, see SendLevel.
ja: SendLevel、#InputLevelの使用方法については、SendLevelをご覧ください。

source: For an integer ID, the resource name must be a hash sign (#) followed by a decimal number.
ja: 整数IDの場合、リソース名はハッシュ記号（#）の後に10進数を続けなければならない。

source: For another demonstration of the RAW option, see ClipboardAll example #2.
ja: RAWオプションの他のデモについては、ClipboardAllの例 #2を参照してください。

source: For another example, see Array2D.
ja: 他の例としては、Array2Dを参照。

source: For any event generated by a script to trigger a hook hotkey or hotstring, the send level of the event must be higher than the input level of the hotkey or hotstring.
ja: スクリプトによって生成されたイベントがフックのホットキーやホットストリングをトリガーするためには、イベントの送信レベルがホットキーやホットストリングの入力レベルよりも高くなければなりません。

source: For any single character other than ^!+#{}, Send translates it to the corresponding key combination and presses and releases that combination.
ja: Sendは、^!+#{}以外の任意の1文字について、それを対応するキーの組み合わせに変換し、その組み合わせを押したり離したりします。

source: For any variable x, if ComObjType(x) returns an integer, x contains a COM object wrapper.
ja: 任意の変数xに対して、ComObjType(x)が整数を返す場合、xはCOMオブジェクトラッパーを含む。

source: For applications which are not DPI-aware, the operating system automatically scales coordinates passed to and returned from certain system functions.
ja: DPIを意識していないアプリケーションの場合、オペレーティング・システムは、特定のシステム関数に渡されたり返されたりする座標を自動的にスケーリングします。

source: For applications which are not per-monitor DPI-aware, the system performs bitmap scaling to allow windows to change sizes when they move between screens, and hides this from the application by reporting coordinates and sizes scaled to the global DPI setting that the application expects to have.
ja: モニターごとのDPIを意識しないアプリケーションの場合、システムはビットマップのスケーリングを実行し、ウィンドウがスクリーン間を移動するときにサイズを変更できるようにします。そして、アプリケーションが期待するグローバルDPI設定にスケーリングされた座標とサイズを報告することで、アプリケーションからこれを隠します。

source: For backreferences above 9 (and optionally those below 9), enclose the number in braces; e.g. ${10}, ${11}, and so on.
ja: 9以上の後方参照（9以下の後方参照も可）の場合は、${10}、${11}などのように中括弧で囲みます。

source: For better reliability, 0 is recommended as an alternative to -1.
ja: 信頼性を高めるために、-1の代わりに0を推奨します。

source: For both ComValue and ComObjFromPtr, be warned that AddRef is never called automatically; in that respect, they behave like ComObject(9, value, 1) or ComObject(13, value, 1) in v1.
ja: ComValueとComObjFromPtrは、AddRefが自動的に呼び出されることはないので、その点ではv1のComObject(9, value, 1)やComObject(13, value, 1)と同じ挙動をすることに注意。

source: For buffers allocated by the script, the new Buffer object is preferred over a variable; any object can be used, but must have Ptr and Size properties.
ja: スクリプトによって割り当てられたバッファの場合、変数よりも新しいBufferオブジェクトが優先されます。任意のオブジェクトを使用できますが、Ptrと Sizeプロパティを持つ必要があります。

source: For buffers allocated by the script, the new Buffer object is preferred over a variable.
ja: スクリプトによって割り当てられたバッファについては、変数よりも新しいBufferオブジェクトが優先されます。

source: For buttons, checkboxes, and radio buttons, pressing the shortcut is the same as clicking the control.
ja: ボタン、チェックボックス、ラジオボタンの場合、ショートカットを押すことはコントロールをクリックすることと同じです。

source: For case-insensitive comparisons, only the ASCII letters A-Z are considered equivalent to their lowercase counterparts.
ja: 大文字と小文字を区別しない比較では、ASCII文字のA-Zのみが小文字と同等とみなされる。

source: For characters in the range a-z or A-Z (plain ASCII letters), each character which does not exist in the current keyboard layout may be sent either as a character or as the corresponding virtual keycode (vk41-vk5A):
ja: a-zまたはA-Z（ASCII文字）の範囲にある文字については、現在のキーボードレイアウトに存在しない各文字を、文字として、または対応する仮想キーコード（vk41～vk5A）として送信することができます：

source: For checkboxes and radio buttons, this also puts the box itself on the right side of the control rather than the left.
ja: チェックボックスやラジオボタンの場合、ボックス自体もコントロールの左側ではなく、右側に配置されます。

source: For clarity, callbacks should return a non-empty value after destroying the GUI.
ja: わかりやすくするために、コールバックはGUIを破壊した後、空でない値を返すようにします。

source: For compiled scripts (i.e. if an embedded script with the ID #1 exists), this parameter must be preceded by the /script switch.
ja: コンパイル済みスクリプトの場合（つまり、ID #1の埋め込みスクリプトが存在する場合）、このパラメータの前に/scriptスイッチを付ける必要があります。

source: For compiled scripts based on an .exe file, A_AhkPath contains the full path of the compiled script.
ja: .exeファイルに基づいてコンパイルされたスクリプトの場合、A_AhkPathにはコンパイルされたスクリプトのフルパスが含まれます。

source: For compiled scripts based on an EXE file, /debug must be specified after /script.
ja: EXEファイルに基づいてコンパイルされたスクリプトの場合、/scriptの後に/debugを指定する必要があります。

source: For complex scripts, see Interactive Debugging.
ja: 複雑なスクリプトについては、「インタラクティブ・デバッグ」を参照してください。

source: For consistency, directives also follow the new convention (there must not be a comma between the directive name and parameter).
ja: 一貫性を保つため、ディレクティブも新しい規約に従っています（ディレクティブ名とパラメータの間にコンマがあってはいけません）。

source: For convenience, a function parameter can be declared ByRef by prefixing the parameter name with ampersand (&).
ja: 関数パラメータは，パラメータ名の前にアンパサンド（&）を付けることで，便宜上ByRefとすることができます。

source: For counted loops such as Loop, changing A_Index affects the number of iterations that will be performed.
ja: Loopのようなカウントループの場合、A_Indexを変更すると、実行される反復回数に影響する。

source: For counted loops, modifying this affects how many iterations are performed.
ja: カウントループの場合、この値を変更すると、何回繰り返し実行されるかに影響します。

source: For detailed information about the PCRE-standard callout feature, see pcre.txt.
ja: PCRE標準のコールアウト機能の詳細については、pcre.txtをご覧ください。

source: For details about both parameters, see Gui.SetFont.
ja: 両パラメータの詳細については、Gui.SetFontを参照してください。

source: For details about how to access the registry of a remote computer, see the remarks in registry loop.
ja: リモートコンピュータのレジストリにアクセスする方法については、レジストリループの備考をご覧ください。

source: For details about how to access the registry of a remote computer, see the remarks in registry-loop.
ja: リモートコンピュータのレジストリにアクセスする方法については、registry-loopの備考を参照してください。

source: For details about syntax - that is, how to write or recognise control flow statements in AutoHotkey - see Control Flow.
ja: 構文についての詳細、つまりAutoHotkeyで制御フロー文を書いたり認識したりする方法については、「制御フロー」を参照してください。

source: For details about the ActiveX component and its method used below, see WebBrowser object (Microsoft Docs) and Navigate method (Microsoft Docs).
ja: 以下で使用される ActiveXコンポーネントとそのメソッドの詳細については、WebBrowserオブジェクト(Microsoft Docs)およびNavigateメソッド (Microsoft Docs)を参照してください。

source: For details about the COM object and DocumentComplete event used below, see InternetExplorer object (Microsoft Docs).
ja: 以下で使用するCOMオブジェクトとDocumentCompleteイベントの詳細は、InternetExplorerオブジェクト (Microsoft Docs)をご覧ください。

source: For details about the COM object and its properties used below, see Word.Application object (Microsoft Docs).
ja: 以下で使用するCOMオブジェクトとそのプロパティの詳細については、Word.Applicationオブジェクト (Microsoft Docs)をご覧ください。

source: For details about the COM object used below, see Using the ScriptControl (Microsoft Docs).
ja: 以下で使用するCOMオブジェクトの詳細については、ScriptControlの使用法（Microsoft Docs）を参照してください。

source: For details about the range and accuracy of numeric values, see Pure Numbers.
ja: 数値の範囲や精度については、「純粋な数値」をご覧ください。

source: For details and an example, see Freeing Objects.
ja: 詳細と例については、オブジェクトの解放を参照してください。

source: For details and examples, see BoundFunc object.
ja: 詳細および例については、BoundFuncオブジェクトをご覧ください。

source: For details see DllCall Types.
ja: 詳しくはDllCallの種類をご覧ください。

source: For details such as maximum length and usable characters, see Names.
ja: 最大文字数や使用可能文字数などの詳細は、名前を参照してください。

source: For details, see A_Clipboard.
ja: 詳細はA_Clipboardを参照。

source: For details, see A_MaxHotkeysPerInterval.
ja: 詳細はA_MaxHotkeysPerIntervalを参照。

source: For details, see A_MenuMaskKey.
ja: 詳細はA_MenuMaskKeyを参照。

source: For details, see Binary Compatibility.
ja: 詳しくは、「バイナリ互換性」をご覧ください。

source: For details, see Boolean Values.
ja: 詳細はブール値をご覧ください。

source: For details, see ContextMenu.
ja: 詳しくは、「ContextMenu」をご覧ください。

source: For details, see CoordMode.
ja: 詳細はCoordModeを参照。

source: For details, see DetectHiddenText.
ja: 詳細はDetectHiddenTextを参照。

source: For details, see DetectHiddenWindows.
ja: 詳細はDetectHiddenWindowsを参照。

source: For details, see FileEncoding.
ja: 詳細はFileEncodingを参照。

source: For details, see ListLines.
ja: 詳細はListLinesを参照。

source: For details, see RegExMatch.
ja: 詳しくは、RegExMatchをご覧ください。

source: For details, see Safe Browsing.
ja: 詳しくは、「セーフブラウジング」をご覧ください。

source: For details, see Script Library Folders.
ja: 詳しくは、スクリプトライブラリフォルダを参照してください。

source: For details, see SendLevel.
ja: 詳細はSendLevelを参照。

source: For details, see SendMode.
ja: 詳細はSendModeを参照。

source: For details, see SetControlDelay.
ja: 詳細はSetControlDelayを参照。

source: For details, see SetDefaultMouseSpeed.
ja: 詳細はSetDefaultMouseSpeedを参照。

source: For details, see SetKeyDelay.
ja: 詳細はSetKeyDelayを参照。

source: For details, see SetRegView.
ja: 詳細はSetRegViewを参照。

source: For details, see SetTitleMatchMode.
ja: 詳細はSetTitleMatchModeを参照。

source: For details, see SetWinDelay.
ja: 詳細はSetWinDelayを参照。

source: For details, see {...} (block).
ja: 詳しくは、{...}（ブロック）を参照してください。

source: For details, see #NoTrayIcon.
ja: 詳細は#NoTrayIconを参照。

source: For details, see .NET Framework Interop (which currently utilizes DllCall and is not compatible with AutoHotkey v2).
ja: 詳しくは、.NET Framework Interop（現在DllCallを利用しており、AutoHotkey v2とは互換性がありません）をご覧ください。

source: For details, see Expression Statements.
ja: 詳しくは表現ステートメントを参照。

source: For details, see Function Calls.
ja: 詳細については、関数呼び出しを参照のこと。

source: For details, see Passing Command Line Parameters to a Script.
ja: 詳細については、スクリプトにコマンドラインパラメータを渡すを参照してください。

source: For details, see SetMouseDelay.
ja: 詳細はSetMouseDelayを参照。

source: For details, see StrCompare.
ja: 詳細はStrCompareを参照。

source: For details, see The Control Parameter.
ja: 詳しくはControlパラメータをご覧ください。

source: For details, see Detecting Changes (Slider).
ja: 詳しくは、「変化の検出（スライダー）」をご覧ください。

source: For details, see SetControlDelay remarks.
ja: 詳しくは、SetControlDelayの備考をご覧ください。

source: For details, see SetStoreCapsLockMode.
ja: 詳細はSetStoreCapsLockModeを参照。

source: For details, see Use in other editors.
ja: 詳しくは、他のエディタでの使用を参照してください。

source: For details, see A_HotkeyModifierTimeout.
ja: 詳細はA_HotkeyModifierTimeoutを参照。

source: For details, see Object Protocol and Operators for Objects.
ja: 詳しくは、「オブジェクトプロトコル」および「オブジェクトの演算子」をご覧ください。

source: For details, see Text mode.
ja: 詳しくは、「テキストモード」をご覧ください。

source: For details, see custom combinations of keys.
ja: 詳しくは、キーのカスタムコンビネーションをご覧ください。

source: For details, see the FAQ.
ja: 詳細はFAQを参照。

source: For details, see the remarks below.
ja: 詳しくは、下記の備考をご覧ください。

source: For detecting and responding to clipboard changes.
ja: クリップボードの変化を検知して対応するため。
